In [2]:
import pandas as pd

In [9]:
ser = {
    'a': pd.Series([1,2,3,4,5]),
    'b': pd.Series([10,20,30,40,50])
}

In [10]:
df = pd.DataFrame(data=ser)

In [11]:
df

   a   b
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

addition of two columns

In [12]:
df['sum of a & b'] = df['a'] + df['b']

In [13]:
df

   a   b  sum of a & b
0  1  10            11
1  2  20            22
2  3  30            33
3  4  40            44
4  5  50            55

Logical operators

In [16]:
df['greater_30_b'] = df['b'] >= 30

In [17]:
df

   a   b  sum of a & b  greater_30_b
0  1  10            11         False
1  2  20            22         False
2  3  30            33          True
3  4  40            44          True
4  5  50            55          True

In [20]:
df['%2_SOa&b'] = df['sum of a & b'] %2==0

In [21]:
df

   a   b  sum of a & b  greater_30_b  %2_SOa&b
0  1  10            11         False     False
1  2  20            22         False      True
2  3  30            33          True     False
3  4  40            44          True      True
4  5  50            55          True     False